## Staging: performance-test
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 11 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.perf_test_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "perf_test_container_definition"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            [
              {
                "logConfiguration": {
                  "logDriver": "awslogs",
                  "options": {
                    "awslogs-group": "${AWS_LOGS_GROUP}",
                    "awslogs-region": "${AWS_LOGS_REGION}",
                    "awslogs-stream-prefix": "${AWS_LOGS_STREAM_PREFIX}"
                  }
                },
                "ulimits": [
                  {
                    "name": "nofile",
                    "softLimit": 98304,
                    "hardLimit": 98304
                  }
                ],
                "volumesFrom": [],
                "essential": true,
                "name": "performance test",
                "image": "${ECR_REPOSITORY_URL}",
                
                "environment": [
                  {
                    "name": "PERF_TEST_AWS_S3_BUCKET",
                    "value": "${PERF_TEST_AWS_S3_BUCKET}"
                  },
                  {
                    "name": "PERF_TEST_CSV_DIRECTORY_PATH",
                    "value": "${PERF_TEST_CSV_DIRECTORY_PATH}"
                  },
                  {
                    "name": "PERF_TEST_SMS_TEMPLATE_ID",
                    "value": "${PERF_TEST_SMS_TEMPLATE_ID}"
                  },
                  {
                    "name": "PERF_TEST_BULK_EMAIL_TEMPLATE_ID",
                    "value": "${PERF_TEST_BULK_EMAIL_TEMPLATE_ID}"
                  },
                  {
                    "name": "PERF_TEST_EMAIL_TEMPLATE_ID",
                    "value": "${PERF_TEST_EMAIL_TEMPLATE_ID}"
                  },
                  {
                    "name": "PERF_TEST_EMAIL_WITH_ATTACHMENT_TEMPLATE_ID",
                    "value": "${PERF_TEST_EMAIL_WITH_ATTACHMENT_TEMPLATE_ID}"
                  },
                  {
                    "name": "PERF_TEST_EMAIL_WITH_LINK_TEMPLATE_ID",
                    "value": "${PERF_TEST_EMAIL_WITH_LINK_TEMPLATE_ID}"
                  },
                  
                ],
                "secrets": [
                  {
                    "name": "PERF_TEST_PHONE_NUMBER",
                    "valueFrom": "${perf_test_phone_number_arn}"
                  },
                  {
                    "name": "PERF_TEST_EMAIL",
                    "valueFrom": "${perf_test_email_arn}"
                  },
                  {
                    "name": "PERF_TEST_DOMAIN",
                    "valueFrom": "${perf_test_domain_arn}"
                  },
                  {
                    "name": "TEST_AUTH_HEADER",
                    "valueFrom": "${test_auth_header_arn}"
                  }
                ]
              }
            ]
        EOT
      + vars     = {
          + "AWS_LOGS_GROUP"                              = "performance_test_cluster"
          + "AWS_LOGS_REGION"                             = "ca-central-1"
          + "AWS_LOGS_STREAM_PREFIX"                      = "performance_test_cluster-task"
          + "ECR_REPOSITORY_URL"                          = "239043911459.dkr.ecr.ca-central-1.amazonaws.com/notify/performance-test"
          + "PERF_TEST_AWS_S3_BUCKET"                     = "notify-performance-test-results-staging"
          + "PERF_TEST_BULK_EMAIL_TEMPLATE_ID"            = "fa759679-30f2-4666-94e2-bd4921329c46"
          + "PERF_TEST_CSV_DIRECTORY_PATH"                = "/tmp/notify_performance_test"
          + "PERF_TEST_EMAIL_TEMPLATE_ID"                 = "fa759679-30f2-4666-94e2-bd4921329c46"
          + "PERF_TEST_EMAIL_WITH_ATTACHMENT_TEMPLATE_ID" = "fa759679-30f2-4666-94e2-bd4921329c46"
          + "PERF_TEST_EMAIL_WITH_LINK_TEMPLATE_ID"       = "9fb324a5-821d-4b54-9d52-d9ba1fa8373a"
          + "PERF_TEST_SMS_TEMPLATE_ID"                   = "d5fea9f3-f69d-481e-9186-b7f4eaa5cf63"
          + "perf_test_domain_arn"                        = (known after apply)
          + "perf_test_email_arn"                         = (known after apply)
          + "perf_test_phone_number_arn"                  = (known after apply)
          + "test_auth_header_arn"                        = (known after apply)
        }
    }

  # aws_cloudwatch_event_target.ecs_scheduled_task will be created
  + resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
      + arn            = "arn:aws:ecs:ca-central-1:239043911459:cluster/performance_test_cluster"
      + event_bus_name = "default"
      + id             = (known after apply)
      + role_arn       = "arn:aws:iam::239043911459:role/performance_test_cluster-ecs-task"
      + rule           = "perf_test_event_rule"
      + target_id      = (known after apply)

      + ecs_target {
          + enable_ecs_managed_tags = false
          + enable_execute_command  = false
          + launch_type             = "FARGATE"
          + platform_version        = "1.4.0"
          + propagate_tags          = "TASK_DEFINITION"
          + task_count              = 1
          + task_definition_arn     = (known after apply)

          + network_configuration {
              + assign_public_ip = false
              + security_groups  = (known after apply)
              + subnets          = [
                  + "subnet-0c7d18c0c51b28b61",
                  + "subnet-0c91f7c6b8211904b",
                  + "subnet-0cecd9e634daf82d3",
                ]
            }
        }
    }

  # aws_ecs_task_definition.perf_test_task will be created
  + resource "aws_ecs_task_definition" "perf_test_task" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "2"
      + execution_role_arn       = "arn:aws:iam::239043911459:role/container_execution_role"
      + family                   = "performance_test_cluster"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags                     = {
          + "CostCentre" = "notification-canada-ca-staging"
        }
      + tags_all                 = {
          + "CostCentre" = "notification-canada-ca-staging"
        }
      + task_role_arn            = "arn:aws:iam::239043911459:role/performance_test_cluster-ecs-task"
    }

  # aws_secretsmanager_secret.perf_test_domain will be created
  + resource "aws_secretsmanager_secret" "perf_test_domain" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "perf_test_domain"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = (known after apply)

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # aws_secretsmanager_secret.perf_test_email will be created
  + resource "aws_secretsmanager_secret" "perf_test_email" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "perf_test_email"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = (known after apply)

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # aws_secretsmanager_secret.perf_test_phone_number will be created
  + resource "aws_secretsmanager_secret" "perf_test_phone_number" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "perf_test_phone_number"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = (known after apply)

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # aws_secretsmanager_secret.test_auth_header will be created
  + resource "aws_secretsmanager_secret" "test_auth_header" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "test_auth_header"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = (known after apply)

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # aws_secretsmanager_secret_version.perf_test_domain will be created
  + resource "aws_secretsmanager_secret_version" "perf_test_domain" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.perf_test_email will be created
  + resource "aws_secretsmanager_secret_version" "perf_test_email" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.perf_test_phone_number will be created
  + resource "aws_secretsmanager_secret_version" "perf_test_phone_number" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.test_auth_header will be created
  + resource "aws_secretsmanager_secret_version" "test_auth_header" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_security_group.perf_test will be created
  + resource "aws_security_group" "perf_test" {
      + arn                    = (known after apply)
      + description            = "Performance Test Security Group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "perf_test"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-097508d1f5e243195"
    }

Plan: 11 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>